alt-tab
calibre
dbeaver-community
emacs
emacs-app
flux
flux-app
font-iosevka
fuse-t
fuse-t-sshfs
ghostty
gifcapture
karabiner-elements
kitty
kopiaui
love
mysqlworkbench
racket
redis-stack
redis-stack-redisinsight
redis-stack-server
vlc
vscodium
wezterm
